vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
static inline void motion_csv_print(uint8_t axis, uint32_t id, uint32_t t_val, int32_t rel, uint32_t steps)
{
#if MOTION_CSV_BIN_ITM
    // Frame binário compacto: [tag(1) axis(1) id(4) t(4) rel(4) steps(4)]
    // tag='E' (0x45) para encoder; axis=0..2
    if (motion_swo_enabled()) {
        ITM_SendChar('E');
        ITM_SendChar((uint32_t)axis);
        uint32_t v;
        v = id;      for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = t_val;   for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = (uint32_t)rel; for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        v = steps;   for (int i=0;i<4;i++) ITM_SendChar((v >> (i*8)) & 0xFF);
        ITM_SendChar('\n');
        return;
    }
#endif

#if MOTION_CSV_TEXT_ENABLE
#if MOTION_CSV_INCLUDE_ID
    // Texto: axis,id,time,rel,steps (rel como int32 para evitar wrap sem sinal)
    printf("%u,%lu,%lu,%d,%lu\r\n",
           (unsigned)axis,
           (unsigned long)id,
           (unsigned long)t_val,
           (int)rel,
           (unsigned long)steps);
#else
    // Compatibilidade: axis,time,rel,steps
    printf("%u,%lu,%d,%lu\r\n",
           (unsigned)axis,
           (unsigned long)t_val,
           (int)rel,
           (unsigned long)steps);
#endif
#endif /* MOTION_CSV_TEXT_ENABLE */
}

static uint32_t g_step_print_count[MOTION_AXIS_COUNT] = {0,0,0};

static volatile uint8_t g_demo_continuous = 0u; /* 1 = gera passos continuamente (modo DEMO) */
static const uint16_t  g_demo_speed_table[4] = { 5u, 10u, 20u, 40u }; /* ksteps/s aprox (TIM7 ~1kHz) */
static volatile uint8_t g_demo_speed_idx = 1u;

/* =======================
 *  Helpers de lock
 * ======================= */
static inline uint32_t motion_lock(void) {
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    return primask;
}
static inline void motion_unlock(uint32_t primask) {
    __set_PRIMASK(primask);
}

#if MOTION_FRICTION_ENABLE
static void motion_auto_friction_clear_samples(motion_auto_friction_test_t *test) {
    for (uint8_t i = 0u; i < 2u; ++i) {
        test->sample_count[i] = 0u;
        test->sum_base[i] = 0u;
        test->sum_cmd[i] = 0u;
        test->sum_act[i] = 0u;
    }
}

void motion_auto_friction_test_arm(uint16_t toggle_segment_index, uint16_t sample_limit) {
    motion_auto_friction_test_t *test = &g_auto_friction_test;
    uint32_t primask = motion_lock();
    test->armed = 1u;
    test->collecting = 0u;
    test->friction_applied = 0u;
    test->result_reported = 0u;
    test->current_segment = 0u;
    test->toggle_segment_index = (toggle_segment_index == 0u)
                                 ? MOTION_AUTO_FRICTION_DEFAULT_TOGGLE_SEGMENT
                                 : toggle_segment_index;
    test->sample_limit = (sample_limit == 0u)
                         ? MOTION_AUTO_FRICTION_DEFAULT_SAMPLE_LIMIT
                         : sample_limit;
    motion_auto_friction_clear_samples(test);
    test->prev_friction_state = g_axis_friction_enabled[test->axis_friction];
    g_axis_friction_enabled[test->axis_friction] = 0u;
    motion_unlock(primask);

    printf("[AUTO-FRIC] armed toggle_seg=%u sample_limit=%u monitor_axis=%u friction_axis=%u prev=%u\r\n",
           (unsigned)test->toggle_segment_index,
           (unsigned)test->sample_limit,
           (unsigned)test->axis_monitor,
           (unsigned)test->axis_friction,
           (unsigned)test->prev_friction_state);
}

void motion_auto_friction_test_disarm(void) {
    motion_auto_friction_test_t *test = &g_auto_friction_test;
    uint32_t primask = motion_lock();
    g_axis_friction_enabled[test->axis_friction] = test->prev_friction_state;
    test->armed = 0u;
    test->collecting = 0u;
    test->friction_applied = 0u;
    test->result_reported = 0u;
    test->current_segment = 0u;
    motion_auto_friction_clear_samples(test);
    motion_unlock(primask);
}

static void motion_auto_friction_on_segment_begin_locked(const move_queue_add_req_t *seg) {
    (void)seg;
    motion_auto_friction_test_t *test = &g_auto_friction_test;
    if (!test->armed) return;
    if (test->collecting == 0u) {
        test->collecting = 1u;
    }
    if (test->current_segment < UINT16_MAX) {
        test->current_segment++;
    }
    if (!test->friction_applied && test->current_segment == test->toggle_segment_index) {
        g_axis_friction_enabled[test->axis_friction] = 1u;
        test->friction_applied = 1u;
        printf("[AUTO-FRIC] friction axis %u enabled at segment %u\r\n",
               (unsigned)test->axis_friction,
               (unsigned)test->current_segment);
    }
}

static void motion_auto_friction_record_sample(uint8_t axis,
                                               uint32_t v_base_sps,
                                               uint32_t v_cmd_sps,
                                               uint32_t v_act_sps) {
    motion_auto_friction_test_t *test = &g_auto_friction_test;
    if (!test->armed || !test->collecting) return;
    if (axis != test->axis_monitor) return;
    uint8_t phase = test->friction_applied ? 1u : 0u;
    if (test->sample_count[phase] >= test->sample_limit) return;
    test->sum_base[phase] += v_base_sps;
    test->sum_cmd[phase]  += v_cmd_sps;
    test->sum_act[phase]  += v_act_sps;
    test->sample_count[phase]++;
}

static uint32_t motion_auto_friction_avg(uint64_t sum, uint32_t count) {
    if (count == 0u) return 0u;
    return (uint32_t)(sum / (uint64_t)count);
}

static uint32_t motion_auto_abs_i32(int32_t v) {
    return (uint32_t)((v < 0) ? -v : v);
}

static void motion_auto_friction_finalize(void) {
    motion_auto_friction_test_t *test = &g_auto_friction_test;
    g_axis_friction_enabled[test->axis_friction] = test->prev_friction_state;
    test->armed = 0u;
    test->collecting = 0u;
    test->friction_applied = 0u;
    test->result_reported = 0u;
    motion_auto_friction_clear_samples(test);
}

static void motion_auto_friction_maybe_report(void) {
    motion_auto_friction_test_t *test = &g_auto_friction_test;
    if (!test->armed) return;
    if (test->result_reported) return;
    if (!test->collecting) return;
    if (g_status.state == MOTION_RUNNING || g_has_active_segment) return;
    if (g_queue_count != 0u) return;

