vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    test->result_reported = 1u;
    uint32_t before_samples = test->sample_count[0];
    uint32_t after_samples  = test->sample_count[1];
    uint32_t avg_base_before = motion_auto_friction_avg(test->sum_base[0], before_samples);
    uint32_t avg_base_after  = motion_auto_friction_avg(test->sum_base[1], after_samples);
    uint32_t avg_cmd_before  = motion_auto_friction_avg(test->sum_cmd[0], before_samples);
    uint32_t avg_cmd_after   = motion_auto_friction_avg(test->sum_cmd[1], after_samples);
    uint32_t avg_act_before  = motion_auto_friction_avg(test->sum_act[0], before_samples);
    uint32_t avg_act_after   = motion_auto_friction_avg(test->sum_act[1], after_samples);

    int32_t delta_cmd = (int32_t)avg_cmd_after - (int32_t)avg_cmd_before;
    int32_t delta_act = (int32_t)avg_act_after - (int32_t)avg_act_before;
    const char *effect = "INCONCLUSIVE";
    int32_t delta_cmd_pm = 0;
    int32_t delta_act_pm = 0;
    if (before_samples > 0u && after_samples > 0u) {
        uint32_t ref_cmd = (avg_cmd_before == 0u) ? 1u : avg_cmd_before;
        uint32_t ref_act = (avg_act_before == 0u) ? 1u : avg_act_before;
        delta_cmd_pm = (int32_t)(((int64_t)delta_cmd * 1000LL) / (int64_t)ref_cmd);
        delta_act_pm = (int32_t)(((int64_t)delta_act * 1000LL) / (int64_t)ref_act);
        uint32_t cmd_abs = motion_auto_abs_i32(delta_cmd_pm);
        uint32_t act_abs = motion_auto_abs_i32(delta_act_pm);
        uint8_t detected = (cmd_abs >= MOTION_AUTO_FRICTION_EFFECT_THRESHOLD_PM) ||
                           (act_abs >= MOTION_AUTO_FRICTION_EFFECT_THRESHOLD_PM);
        effect = detected ? "EFFECT" : "NO_EFFECT";
    }

    printf("[AUTO-FRIC] toggle_seg=%u samples(before=%lu,after=%lu) "
           "base_avg(before=%lu,after=%lu) cmd_avg(before=%lu,after=%lu) "
           "act_avg(before=%lu,after=%lu) delta_cmd=%ld delta_act=%ld "
           "delta_cmd_pm=%ld delta_act_pm=%ld result=%s\r\n",
           (unsigned)test->toggle_segment_index,
           (unsigned long)before_samples, (unsigned long)after_samples,
           (unsigned long)avg_base_before, (unsigned long)avg_base_after,
           (unsigned long)avg_cmd_before,  (unsigned long)avg_cmd_after,
           (unsigned long)avg_act_before,  (unsigned long)avg_act_after,
           (long)delta_cmd, (long)delta_act,
           (long)delta_cmd_pm, (long)delta_act_pm,
           effect);

    motion_auto_friction_finalize();
}

static move_queue_add_req_t motion_auto_friction_make_segment_template(void) {
    move_queue_add_req_t seg = move_queue_add_req_make_default();
    seg.dirMask = MOTION_AUTO_FRICTION_SEG_DIRMASK;
    seg.vx = MOTION_AUTO_FRICTION_SEG_VX;
    seg.vy = MOTION_AUTO_FRICTION_SEG_VY;
    seg.vz = MOTION_AUTO_FRICTION_SEG_VZ;
    seg.sx = MOTION_AUTO_FRICTION_SEG_SX;
    seg.sy = MOTION_AUTO_FRICTION_SEG_SY;
    seg.sz = MOTION_AUTO_FRICTION_SEG_SZ;
    return seg;
}

static proto_result_t motion_auto_friction_enqueue_segments_locked(uint8_t revolutions) {
    if (revolutions == 0u) return PROTO_ERR_ARG;
    move_queue_add_req_t seg = motion_auto_friction_make_segment_template();
    for (uint8_t i = 0; i < revolutions; ++i) {
        seg.frameId = (uint8_t)(MOTION_AUTO_FRICTION_FRAME_BASE + i);
        proto_result_t st = motion_queue_push_locked(&seg);
        if (st != PROTO_OK) {
            return st;
        }
    }
    return PROTO_OK;
}
#else
void motion_auto_friction_test_arm(uint16_t toggle_segment_index, uint16_t sample_limit) {
    (void)toggle_segment_index;
    (void)sample_limit;
}
void motion_auto_friction_test_disarm(void) { }
static void motion_auto_friction_maybe_report(void) { }
static move_queue_add_req_t motion_auto_friction_make_segment_template(void) {
    return move_queue_add_req_make_default();
}
static proto_result_t motion_auto_friction_enqueue_segments_locked(uint8_t revolutions) {
    (void)revolutions;
    return PROTO_ERR_RANGE;
}
#endif

/* Forward decl. para função usada pela seleção de mestre (progress) */
static uint32_t motion_remaining_steps_total_for_axis(uint8_t axis);

/* =======================
 *  Seleção de Mestre (modo progress)
 * ======================= */
#if MOTION_PROGRESS_MODE
static inline int8_t motion_select_master_axis_progress(void)
{
    int8_t master = -1;
    uint32_t m_num = 0u, m_den = 1u;

    /* 1) Preferir o menor progresso ENTRE eixos que ainda têm trabalho (ativo+fila)
          e que participam do segmento atual (total_steps>0). */
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        /* total restante (ativo + fila) em O(1) */
        const motion_axis_state_t *ax = &g_axis_state[axis];
        uint32_t active = (ax->total_steps > ax->emitted_steps)
                          ? (ax->total_steps - ax->emitted_steps) : 0u;
        uint32_t rem_total = active + g_queue_rem_steps[axis];
        if (rem_total == 0u) continue; /* não escolher quem já acabou de vez */
        if (ax->total_steps == 0u) continue; /* não participa do segmento atual */

        uint32_t num = ax->emitted_steps; /* progresso acumulado */
        uint32_t den = ax->total_steps;   /* tamanho do segmento */
        if (master < 0) { master = (int8_t)axis; m_num = num; m_den = den; }
        else if ((uint64_t)num * (uint64_t)m_den < (uint64_t)m_num * (uint64_t)den) {
            master = (int8_t)axis; m_num = num; m_den = den;
        }
    }

    /* 2) Fallback: se ninguém do segmento atual tem rem_total>0, escolha
          o eixo com MAIOR rem_total geral (apontando para o próximo da fila). */
    if (master < 0) {
        uint32_t best_rem = 0u;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            uint32_t active = (ax->total_steps > ax->emitted_steps)
                              ? (ax->total_steps - ax->emitted_steps) : 0u;
            uint32_t rem_total = active + g_queue_rem_steps[axis];
            if (rem_total > best_rem) { best_rem = rem_total; master = (int8_t)axis; }
        }
    }

