vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
            if (ax->step_high) continue;
            if (ax->step_low)  continue; 
            if (ax->emitted_steps >= ax->total_steps) continue;

            if (ax->en_settle_ticks)  { ax->en_settle_ticks--;  continue; }
            if (ax->dir_settle_ticks) { ax->dir_settle_ticks--; continue; }

            /* DDA (fila): acumula fase e emite STEP no cruzamento de 1.0 */
            ax->dda_accum_q16 += ax->dda_inc_q16;
            if (ax->dda_accum_q16 >= Q16_1) {
                ax->dda_accum_q16 -= Q16_1;
                if (ax->emitted_steps < ax->total_steps) {
                    motion_hw_step_high(axis);
                    ax->step_high = MOTION_STEP_HIGH_TICKS;
                    ++ax->emitted_steps;
                    g_csv_stepcount[axis]++;
                    ax->target_steps = ax->emitted_steps;
                    /* Garanta ativação no primeiro STEP mesmo se o "arming" atrasar */
                    if ((g_csv_armed[axis] || g_csv_stepcount[axis] == 1u) && !g_csv_active[axis]) {
                        g_csv_active[axis] = 1u;
                        g_csv_armed[axis]  = 0u;
                        uint32_t now_t6 = g_tim6_ticks;
                        g_csv_t0_t6[axis] = now_t6;
                        g_csv_next_t6[axis] = now_t6;
                    }
#if MOTION_CSV_AT_STEP && !MOTION_CSV_PRODUCE_IN_TIM6
                    if (g_csv_active[axis]) {
                        uint32_t dt_t6 = g_tim6_ticks - g_csv_t0_t6[axis];
#if MOTION_CSV_TIME_IN_TICKS
                        uint32_t t_val = dt_t6;
#else
                        uint32_t t_val = dt_t6 / T6_TICKS_PER_MS;
#endif
                        int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
                        if (g_csv_stepcount[axis] == 1u || (g_csv_stepcount[axis] % MOTION_CSV_STEP_DECIM) == 0u) {
                            uint32_t pm = motion_lock();
                            uint32_t id = ++g_csv_seq[axis];
                            motion_unlock(pm);
                            motion_csv_print(axis, id, t_val, rel, g_csv_stepcount[axis]);
                        }
                    }
#endif
#if MOTION_DEBUG_FLOW
                    #if MOTION_DEBUG_TIM6_PRINTS
                    if ((++g_step_print_count[axis] % MOTION_DEBUG_STEP_DECIM) == 1u) {
                        printf("[STEP axis=%u emitted=%lu target=%lu total=%lu]\\r\\n",
                               (unsigned)axis,
                               (unsigned long)ax->emitted_steps,
                               (unsigned long)ax->target_steps,
                               (unsigned long)ax->total_steps);
                    }
                    #endif
#endif
                }
            }
        }
    }

#if MOTION_CSV_PRODUCE_IN_TIM6
    /* 4) Produção rígida de amostras a cada 1 ms (50 ticks), sem imprimir
       - Apenas empilha amostras para drenagem posterior (TIM7).
       - Começa após o primeiro STEP (g_csv_active[axis]==1). */
    {
        uint32_t now_t6 = g_tim6_ticks;
        if ((int32_t)(now_t6 - g_csv_next_prod_t6) >= 0) {
            /* gera 1..K amostras de 1ms (se houver atraso ocasional) */
            do {
                for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
                    if (!g_csv_active[axis]) continue; /* iniciar no primeiro STEP */
                    uint32_t dt_t6 = now_t6 - g_csv_t0_t6[axis];
                    long rel = (long)(g_encoder_position[axis] - g_encoder_origin[axis]);
                    uint32_t pm = motion_lock();
                    uint32_t id = ++g_csv_seq[axis];
                    motion_unlock(pm);
                    csv_ring_push(axis, id, dt_t6, (int32_t)rel, g_csv_stepcount[axis]);
                }
                g_csv_next_prod_t6 += T6_TICKS_PER_MS;
            } while ((int32_t)(now_t6 - g_csv_next_prod_t6) >= 0);
        }
    }
#endif

    uint32_t primask = motion_lock();
    if (g_has_active_segment) {
        uint8_t confirm = 1u;
        for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
            const motion_axis_state_t *ax = &g_axis_state[axis];
            if (ax->emitted_steps < ax->total_steps || ax->step_high) {
                confirm = 0u; break;
            }
        }
#if MOTION_PROGRESS_MODE
        /* Confirmar término apenas quando não houver trabalho (ativo+fila)
           em NENHUM eixo. Usa soma O(1) por eixo (ativo + fila acumulada). */
        if (!confirm) {
            uint32_t rem_all = 0u;
            for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
                const motion_axis_state_t *ax = &g_axis_state[a];
                uint32_t active = (ax->total_steps > ax->emitted_steps)
                                  ? (ax->total_steps - ax->emitted_steps) : 0u;
                rem_all += active + g_queue_rem_steps[a];
            }
            if (rem_all == 0u) {
                confirm = 1u;
            }
        }
#endif
        if (confirm) {
            if (motion_try_start_next_locked()) {
                g_status.state = MOTION_RUNNING;
#if MOTION_DEBUG_FLOW
                printf("[FLOW next_segment started]\r\n");
#endif
            } else {
                g_has_active_segment = 0u;
                motion_stop_all_axes_locked();
                g_status.state = MOTION_DONE;
                motion_send_move_end_response(g_active_frame_id, 0u /* natural_done */);
                // Fim do movimento: encerrar sessão CSV e zerar contadores
        for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) {
            g_csv_active[a] = 0u;
            g_csv_armed[a]  = 0u;
            g_csv_stepcount[a] = 0u;
            g_csv_seq[a] = 0u;
        }
            }
            motion_refresh_status_locked();
        }
    }
    motion_unlock(primask);
}

/* =======================
 *  Tick do TIM7 (~1 kHz)
 *  - Atualiza encoders
 *  - DEMO: rampa e dda_inc
 *  - Fila: sua original de target_steps
 * ======================= */
void motion_on_tim7_tick(void)
{
    motion_update_encoders();

#if (MOTION_CSV_SAMPLE_MS + 0u) > 0u && !MOTION_CSV_PRODUCE_IN_TIM6
    // Emite CSV (axis,time,rel,steps) periodicamente usando base de tempo do TIM6
    uint32_t now_t6 = g_tim6_ticks;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT; ++axis) {
        if (!g_csv_active[axis]) continue;
        if ((int32_t)(now_t6 - g_csv_next_t6[axis]) >= 0) {
            int32_t rel = (int32_t)(g_encoder_position[axis] - g_encoder_origin[axis]);
            uint32_t dt_t6 = now_t6 - g_csv_t0_t6[axis];
#if MOTION_CSV_TIME_IN_TICKS
            uint32_t t_val = dt_t6;
#else
            uint32_t t_val = dt_t6 / T6_TICKS_PER_MS;
#endif
            uint32_t pm = motion_lock();
            uint32_t id = ++g_csv_seq[axis];
            motion_unlock(pm);
            motion_csv_print(axis, id, t_val, rel, g_csv_stepcount[axis]);
            uint32_t inc_ticks = ((uint32_t)MOTION_CSV_SAMPLE_MS) * (uint32_t)T6_TICKS_PER_MS;
            do { g_csv_next_t6[axis] += inc_ticks; } while ((int32_t)(now_t6 - g_csv_next_t6[axis]) >= 0);
        }
    }
#endif

#if MOTION_CSV_PRODUCE_IN_TIM6
    /* Drena ring buffer (SPSC) produzido no TIM6, com limite por tick */
    uint32_t drained = 0u;
    for (uint8_t axis = 0; axis < MOTION_AXIS_COUNT && drained < MOTION_CSV_DRAIN_PER_TICK; ++axis) {
        while (drained < MOTION_CSV_DRAIN_PER_TICK) {
            motion_csv_sample_t s;
            if (!csv_ring_pop(axis, &s)) break;
            uint32_t t_val;
#if MOTION_CSV_TIME_IN_TICKS
            t_val = s.t6;
#else
            t_val = s.t6 / T6_TICKS_PER_MS;
#endif
            motion_csv_print(axis, s.id, t_val, s.rel, s.steps);
            drained++;
        }
    }
#endif

