vjdias/stm32_cnc_controller/CNC_Controller/App/Src/Services/Motion/motion_service.c
    loops = (req.revolutions == 0u) ? MOTION_AUTO_FRICTION_DEFAULT_REVOLUTIONS : req.revolutions;
    if (loops < 2u) loops = 2u;
    if (loops > (uint8_t)MOTION_QUEUE_CAPACITY) loops = (uint8_t)MOTION_QUEUE_CAPACITY;

    friction_segment = (req.friction_segment == 0u)
                       ? MOTION_AUTO_FRICTION_MIN_SEGMENT_WITH_FRICTION
                       : req.friction_segment;
    if (friction_segment < MOTION_AUTO_FRICTION_MIN_SEGMENT_WITH_FRICTION)
        friction_segment = MOTION_AUTO_FRICTION_MIN_SEGMENT_WITH_FRICTION;
    if (friction_segment > loops)
        friction_segment = MOTION_AUTO_FRICTION_MIN_SEGMENT_WITH_FRICTION;

    sample_limit = (req.sample_limit == 0u) ? MOTION_AUTO_FRICTION_DEFAULT_SAMPLE_LIMIT
                                            : req.sample_limit;

#if MOTION_FRICTION_ENABLE
    do {
        uint32_t primask = motion_lock();
        if (g_status.state == MOTION_RUNNING || g_has_active_segment || g_queue_count != 0u ||
            motion_auto_friction_is_armed()) {
            status = MOTION_AUTO_FRICTION_STATUS_BUSY;
            motion_unlock(primask);
            break;
        }

        motion_queue_clear_locked();
        motion_auto_friction_test_arm((uint16_t)friction_segment, sample_limit);
        proto_result_t sched = motion_auto_friction_enqueue_segments_locked(loops);
        if (sched != PROTO_OK) {
            status = MOTION_AUTO_FRICTION_STATUS_QUEUE_FULL;
            motion_auto_friction_test_disarm();
            motion_queue_clear_locked();
            motion_unlock(primask);
            break;
        }

        if (!g_has_active_segment) {
            if (motion_try_start_next_locked()) {
                g_status.state = MOTION_RUNNING;
                motion_refresh_status_locked();
            }
        }
        motion_unlock(primask);
        status = MOTION_AUTO_FRICTION_STATUS_OK;
        LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "auto_fric_cmd",
                  "loops=%u fric_seg=%u samples=%u",
                  (unsigned)loops, (unsigned)friction_segment, (unsigned)sample_limit);
    } while (0);
#else
    status = MOTION_AUTO_FRICTION_STATUS_UNAVAILABLE;
#endif

send_resp:
    resp.status = status;
    resp.revolutions = loops;
    resp.friction_segment = friction_segment;
    resp.sample_limit = sample_limit;
    uint8_t raw[8];
    if (motion_auto_friction_resp_encoder(&resp, raw, sizeof raw) == PROTO_OK) {
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
    if (status != MOTION_AUTO_FRICTION_STATUS_OK) {
        LOGA_THIS(LOG_STATE_ERROR, status, "auto_fric_cmd", "status=%u", (unsigned)status);
    }
}

void motion_on_set_microsteps(const uint8_t *frame, uint32_t len) {
    set_microsteps_req_t req;
    if (set_microsteps_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_microsteps", "decode_fail");
        return;
    }
    if (g_status.state == MOTION_RUNNING) {
        /* Em execução: não aplica, mas responde ACK para o host não travar */
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "set_microsteps", "busy_running");
    } else {
        uint16_t ms = (req.microsteps == 0u) ? 1u : req.microsteps;
        if (ms > 256u) ms = 256u;
        for (uint8_t a = 0; a < MOTION_AXIS_COUNT; ++a) g_microstep_factor[a] = ms;
        LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_microsteps", "all_axes_ms=%u", (unsigned)ms);
    }
    /* Resposta mínima (ACK): [HDR,TYPE,frameId,TAIL] */
    {
        uint8_t raw[4];
        resp_init(raw, RESP_SET_MICROSTEPS);
        raw[2] = req.frameId;
        resp_set_tail(raw, 3);
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

void motion_on_set_microsteps_axes(const uint8_t *frame, uint32_t len) {
    set_microsteps_axes_req_t req;
    if (set_microsteps_axes_req_decoder(frame, len, &req) != PROTO_OK) {
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_FRAME, "set_microsteps_ax", "decode_fail");
        return;
    }
    if (g_status.state == MOTION_RUNNING) {
        /* Em execução: não aplica, mas responde ACK para o host não travar */
        LOGA_THIS(LOG_STATE_ERROR, PROTO_ERR_RANGE, "set_microsteps_ax", "busy_running");
    } else {
        uint16_t msx = (req.ms_x == 0u) ? 1u : req.ms_x; if (msx > 256u) msx = 256u;
        uint16_t msy = (req.ms_y == 0u) ? 1u : req.ms_y; if (msy > 256u) msy = 256u;
        uint16_t msz = (req.ms_z == 0u) ? 1u : req.ms_z; if (msz > 256u) msz = 256u;
        g_microstep_factor[AXIS_X] = msx;
        g_microstep_factor[AXIS_Y] = msy;
        g_microstep_factor[AXIS_Z] = msz;
        LOGA_THIS(LOG_STATE_APPLIED, PROTO_OK, "set_microsteps_ax", "ms=(%u,%u,%u)", (unsigned)msx, (unsigned)msy, (unsigned)msz);
    }
    /* Resposta mínima (ACK) reutiliza RESP_SET_MICROSTEPS */
    {
        uint8_t raw[4];
        resp_init(raw, RESP_SET_MICROSTEPS);
        raw[2] = req.frameId;
        resp_set_tail(raw, 3);
        (void)app_resp_push(raw, (uint32_t)sizeof raw);
    }
}

/* =====================================================================
 *  DEMO DE MOVIMENTO (PARA TESTE EM BANCADA)
 *  - DDA por TIM6 (50 kHz) com rampa no TIM7 (~1 kHz)
 *  - Timings de STEP/DIR/ENABLE conforme TMC5160
 * ===================================================================== */
void motion_demo_set_enabled(uint8_t enable)
{
    if (!enable) return;

    uint32_t primask = motion_lock();
    if (g_has_active_segment || g_queue_count > 0u) {
        motion_unlock(primask);
        return;
    }

    /* Segmento de teste: XYZ para frente, alvos moderados */
    move_queue_add_req_t req = {0};
    req.frameId = 0xEE;
    req.dirMask = 0x07;            /* XYZ forward */
    req.vx = 10; req.vy = 8; req.vz = 6;      
    req.sx = 2000; req.sy = 1600; req.sz = 1200;

    if (g_queue_count < MOTION_QUEUE_CAPACITY) {
        g_queue[g_queue_tail].req = req;
        g_queue_tail = (uint8_t)((g_queue_tail + 1u) % MOTION_QUEUE_CAPACITY);
        g_queue_count++;
    }

    if (!g_has_active_segment) {
        move_queue_add_req_t next;
        if (motion_queue_pop_locked(&next)) {
            motion_begin_segment_locked(&next);
            g_status.state = MOTION_RUNNING;
            motion_refresh_status_locked();
        }
    }
    motion_unlock(primask);
}

